lcdongjun/stm32epd/01_FreeRTOS移植fatfs驱动EPD成功/HARDWARE/EPD/Config/DEV_Config.h
/*****************************************************************************
* | File      	:   DEV_Config.h
* | Author      :   Waveshare team
* | Function    :   Hardware underlying interface
* | Info        :
*                Used to shield the underlying layers of each master 
*                and enhance portability
*----------------
* |	This version:   V2.0
* | Date        :   2018-10-30
* | Info        :
* 1.add:
*   UBYTE\UWORD\UDOUBLE
* 2.Change:
*   EPD_RST -> EPD_RST_PIN
*   EPD_DC -> EPD_DC_PIN
*   EPD_CS -> EPD_CS_PIN
*   EPD_BUSY -> EPD_BUSY_PIN
* 3.Remote:
*   EPD_RST_1\EPD_RST_0
*   EPD_DC_1\EPD_DC_0
*   EPD_CS_1\EPD_CS_0
*   EPD_BUSY_1\EPD_BUSY_0
* 3.add:
*   #define DEV_Digital_Write(_pin, _value) bcm2835_gpio_write(_pin, _value)
*   #define DEV_Digital_Read(_pin) bcm2835_gpio_lev(_pin)
*   #define DEV_SPI_WriteByte(__value) bcm2835_spi_transfer(__value)
#
# Permission is hereby granted, free of charge, to any person obtaining a copy
# of this software and associated documnetation files (the "Software"), to deal
# in the Software without restriction, including without limitation the rights
# to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
# copies of the Software, and to permit persons to  whom the Software is
# furished to do so, subject to the following conditions:
#
# The above copyright notice and this permission notice shall be included in
# all copies or substantial portions of the Software.
#
# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
# FITNESS OR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
# AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
# LIABILITY WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
# OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
# THE SOFTWARE.
#
******************************************************************************/
#ifndef _DEV_CONFIG_H_
#define _DEV_CONFIG_H_

#include "sys.h"
#include "stm32f4xx.h" 
#include <stdint.h>
#include <stdio.h>
#include "FreeRTOS.h"
#include "task.h"

/**
 * data
**/
#define UBYTE   uint8_t
#define UWORD   uint16_t
#define UDOUBLE uint32_t



#define F_EPD_RST_PIN  PCout(0)	
#define F_EPD_DC_PIN   PCout(1)	
#define F_EPD_PWR_PIN  PCout(5)	
#define F_EPD_CS_PIN   PCout(4)	
#define F_EPD_BUSY_PIN PCout(2)	
#define F_EPD_MOSI_PIN PCout(3)	
#define F_EPD_SCLK_PIN PBout(10)	
/**
 * e-Paper GPIO
**/
#define EPD_RST_PIN     GPIOC, GPIO_Pin_0
#define EPD_DC_PIN      GPIOC, GPIO_Pin_1
#define EPD_PWR_PIN     GPIOC, GPIO_Pin_5
#define EPD_CS_PIN      GPIOC, GPIO_Pin_4
#define EPD_BUSY_PIN    GPIOC, GPIO_Pin_2
#define EPD_MOSI_PIN    GPIOC, GPIO_Pin_3
#define EPD_SCLK_PIN    GPIOB, GPIO_Pin_10

/**
 * GPIO read and write
**/
//#define DEV_Digital_Write(_pin, _value) HAL_GPIO_WritePin(_pin, _value == 0? GPIO_PIN_RESET:GPIO_PIN_SET)
//#define DEV_Digital_Read(_pin) HAL_GPIO_ReadPin(_pin)
#define DEV_Digital_Write(_pin, _value) ((_value) == 0 ? GPIO_ResetBits(_pin) : GPIO_SetBits( _pin))
#define DEV_Digital_Read( _pin) GPIO_ReadInputDataBit( _pin)

/**
 * delay x ms
**/
#define DEV_Delay_ms(__xms) vTaskDelay(pdMS_TO_TICKS(__xms));

void EPD_GPIO_Init(void);

u8 DEV_SPI_WriteByte(UBYTE value);
void DEV_SPI_Write_nByte(UBYTE *value, UDOUBLE len);

int DEV_Module_Init(void);
void DEV_Module_Exit(void);
void DEV_GPIO_Init(void);
void DEV_SPI_Init(void);
void DEV_SPI_SendData(UBYTE Reg);
UBYTE DEV_SPI_ReadData(void);
#endif
